tutorials/H2_O2_N2_splitter/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Splitter-plate mixing layer: 15 mm x 5 mm x 0.2 mm (2D)
//
// Two blocks stacked in y, sharing a mid-plane at y=2.5 mm:
//   lower (y = 0..2.5 mm) : H2 stream
//   upper (y = 2.5..5 mm) : Air stream
//
// Base cell size: ~200 um (x) x ~192 um (y, 13 cells per 2.5 mm block)
// AMR will refine down to ~12.5 um (4 levels).
//
// Inlet conditions:
//   Air  (y=2.5-5 mm left, top BC):  M=2.5, T=1500K, p=101325 Pa
//          c = sqrt(gamma*R_mix*T) = sqrt(1.310 * 288.2 * 1500) = 753 m/s
//          U = 2.5 * 753 = 1882 m/s
//   Fuel (y=0-2.5mm left, bottom BC): M=1.5, T=350K, p=101325 Pa
//          c = sqrt(gamma*R_H2*T)  = sqrt(1.402 * 4123 * 350) = 1422 m/s
//          U = 1.5 * 1422 = 2133 m/s

convertToMeters 0.001;   // all coordinates in mm

vertices
(
    //  back plane (z = -0.1 mm)
    (  0    0    -0.1)   // v0
    ( 15    0    -0.1)   // v1
    ( 15    2.5  -0.1)   // v2
    (  0    2.5  -0.1)   // v3
    (  0    5    -0.1)   // v4
    ( 15    5    -0.1)   // v5

    //  front plane (z = +0.1 mm)
    (  0    0     0.1)   // v6
    ( 15    0     0.1)   // v7
    ( 15    2.5   0.1)   // v8
    (  0    2.5   0.1)   // v9
    (  0    5     0.1)   // v10
    ( 15    5     0.1)   // v11
);

blocks
(
    // Lower block  (H2 stream, y = 0..2.5 mm)
    //   75 x 13 x 1  =>  200 um x ~192 um x 200 um
    hex (0 1 2 3 6 7 8 9)   (75 13 1)  simpleGrading (1 1 1)

    // Upper block  (Air stream, y = 2.5..5 mm)
    hex (3 2 5 4 9 8 11 10) (75 13 1)  simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inletFuel
    {
        type patch;
        faces
        (
            (0 3 9 6)   // left face of lower block
        );
    }

    inletAir
    {
        type patch;
        faces
        (
            (3 4 10 9)  // left face of upper block
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 8 7)   // right face of lower block
            (2 5 11 8)  // right face of upper block
        );
    }

    bottom
    {
        type patch;
        faces
        (
            (0 1 7 6)   // y = 0 face of lower block
        );
    }

    top
    {
        type patch;
        faces
        (
            (4 5 11 10) // y = 5 mm face of upper block
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)   // z = -0.1 mm, lower block
            (3 4 5 2)   // z = -0.1 mm, upper block
            (6 7 8 9)   // z = +0.1 mm, lower block
            (9 8 11 10) // z = +0.1 mm, upper block
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
