tutorials/H2_O2_N2_splitter/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Air:  M=2.5, c=753 m/s  =>  U = 1882 m/s
// Fuel: M=1.5, c=1422 m/s =>  U = 2133 m/s
// Interior initialised with air conditions.

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1882 0 0);

boundaryField
{
    inletAir
    {
        type        fixedValue;
        value       uniform (1882 0 0);
    }

    inletFuel
    {
        type        fixedValue;
        value       uniform (2133 0 0);
    }

    top
    {
        type        fixedValue;
        value       uniform (1882 0 0);
    }

    bottom
    {
        type        fixedValue;
        value       uniform (2133 0 0);
    }

    outlet
    {
        type        zeroGradient;
    }

    frontAndBack
    {
        type        empty;
    }
}

// ************************************************************************* //
