tutorials/H2_O2_N2_splitter/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxScheme      Kurganov;

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         cellLimited Gauss linear 0.7;
}

divSchemes
{
    default         Gauss linear;
    div(rhoPhi,Yi_h) Gauss limitedLinear 1;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default             linear;
    reconstruct(rho)    Minmod;
    reconstruct(rhoU)   MinmodV;
    reconstruct(rPsi)   Minmod;
    reconstruct(e)      Minmod;
    reconstruct(c)      Minmod;
}

snGradSchemes
{
    default             corrected;
}

// ************************************************************************* //
